<?php header('Content-type: application/json');	header('Content-Type: text/html; charset=utf-8'); require 'inc/functions.php'; 		
session_start();
//print_r($_POST);	
if($_POST){
	$time = time();
	// Create New User
	$userins = mysqli_query($link,"INSERT INTO `users` (`id`, `name`, `mobile`, `email`, `pass`, `marketvalue`, `time`) VALUES
	(NULL, 'مراح تك', 555555555, '111@mrah.sa', NULL, '700,800,900,1000,1200,1350,1500,1250,1000,850,700,500,900', 1767747982)");
	
	// Fetch New User ID
	$record = mysqli_query($link,"SELECT * FROM `users` ORDER BY id DESC LIMIT 1 ");
	while($info = mysqli_fetch_array($record, MYSQLI_ASSOC)){ 		$newuserid = $info['id'];		}
	$name = 'مراح تك '.$newuserid;			$email = $newuserid.'@mrah.sa';
	// Update New User Name and Email
	$update = mysqli_query($link,"UPDATE `users` SET `name`='$name', `email`='$email' WHERE `id`='$newuserid'");
	
	//Create New mrah for New User
	$mrahins = mysqli_query($link,"INSERT INTO `mrah` (`id`, `userid`, `name`, `time`, `profit`, `expense`) VALUES (NULL, $newuserid, 'الاستراحه', 1767805628, '0', '0')");

	$record = mysqli_query($link,"SELECT * FROM `mrah` ORDER BY id DESC LIMIT 1 ");
	while($info = mysqli_fetch_array($record, MYSQLI_ASSOC)){ 		$newmrahid = $info['id'];		}

	$ins = mysqli_query($link,"INSERT INTO `capex` (`id`, `userid`, `mrahid`, `description`, `cost`, `timeadded`, `timeedited`) VALUES
	(NULL, $newuserid, $newmrahid, '5 معالف بطول 2 متر', '1250', 1770686784, NULL),
	(NULL, $newuserid, $newmrahid, '3 شبوك بطول 20 متر وارتفاع مترين', '600', 1770686824, NULL)");
	
	$ins = mysqli_query($link,"INSERT INTO `feed` (`id`, `userid`, `mrahid`, `type`, `unit`, `quantity`, `unitcost`, `dailyintake`) VALUES
	(NULL, $newuserid, $newmrahid, 'barley50', 'bag', '20', '72', '2'),
	(NULL, $newuserid, $newmrahid, 'alfalfa', 'block', '164', '17.49', '5'),
	(NULL, $newuserid, $newmrahid, 'hay', 'block', '156', '13', '3'),
	(NULL, $newuserid, $newmrahid, 'barn50', 'bag', '0', '49', '1')");

	$ins = mysqli_query($link,"INSERT INTO `logs` (`id`, `userid`, `mrahid`, `category`, `title`, `details`, `time`) VALUES
	(NULL, $newuserid, $newmrahid, 'purchase', 'إضافة مشتريات أعلاف جديده', 'تم إضافة مشتريات أعلاف جديده 10 كيس شعير 50 كيلو لمراح الاستراحه بتكلفه فرديه 70 ريال وتكلفة إجماليه 700 ريال مدينه بالكامل للبائع مورد برسيم', 1768204467),
	(NULL, $newuserid, $newmrahid, 'feed', 'إضافة كمية أعلاف جديده', 'بسبب إضافة مشتريات أعلاف جديده تم إضافة كمية أعلاف جديده شعير 50 كيلو بمقدار 10 كيس وتكلفة فرديه 70 ريال لمراح الاستراحه', 1768204467),
	(NULL, $newuserid, $newmrahid, 'suppliers', 'إضافة بائع أعلاف', 'تم إضافة بائع أعلاف بإسم مورد برسيم ورقم جوال  لمراح الاستراحه', 1768204467),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث الاستهلاك اليومي للعلف', 'تم تحديث الاستهلاك اليومي للعلف شعير 50 كيلو إلى 2 كيس يومياً', 1768204502),
	(NULL, $newuserid, $newmrahid, 'purchase', 'إضافة مشتريات مياه', 'تم إضافة مشتريات مياه جديده 30000 لتر لمراح الاستراحه بتكلفه فرديه 0.0133 ريال لكل لتر وتكلفة إجماليه 400 ريال تم سدادها بالكامل', 1768204542),
	(NULL, $newuserid, $newmrahid, 'water', 'إضافة كمية مياه', 'بسبب إضافة مشتريات مياه جديده تم إضافة كمية مياه جديده بمقدار 30000 لتر وتكلفة فرديه 0.0133 ريال لكل لتر لمراح الاستراحه', 1768204542),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 163 ووسم رقم 19 ووسم أصفر تغيير العمر من عامين إلى 3 أعوام تغيير تاريخ الضم للمراح من قبل عامين إلى قبل 3 أعوام لمراح الاستراحه', 1768224509),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 115 ووسم رقم 25 ووسم أخضر تغيير الجنس من انثى إلى ذكر تغيير العمر من 4 أشهر إلى 3 أعوام تغيير تاريخ الضم للمراح من قبل 4 أشهر إلى قبل عام لمراح الاستراحه', 1768224564),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف ماعز جنس انثى بلون وسم أبيض ورقم اكتوبر وعمر 24 وتاريخ ضم للمراح ديسمبر لمراح الاستراحه', 1768225017),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف ماعز جنس انثى بلون وسم أبيض ورقم 4 وعمر اكتوبر وتاريخ ضم للمراح اكتوبر لمراح الاستراحه', 1768225090),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف ماعز جنس انثى بلون وسم أبيض ورقم نوفمبر وعمر 48 وتاريخ ضم للمراح ديسمبر لمراح الاستراحه', 1768225144),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 153 ووسم رقم 17 ووسم أبيض تغيير العمر إلى 10 أشهر لمراح الاستراحه', 1768225235),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 159 ووسم رقم 5 ووسم أصفر تغيير لون الوسم من أصفر إلى أبيض لمراح الاستراحه', 1768225259),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف ماعز جنس انثى بلون وسم أبيض ورقم 14 وعمر اكتوبر وتاريخ ضم للمراح اكتوبر لمراح الاستراحه', 1768225321),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف ماعز جنس انثى بلون وسم أبيض ورقم 15 وعمر اكتوبر وتاريخ ضم للمراح اكتوبر لمراح الاستراحه', 1768225338),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 162 ووسم رقم 18 ووسم أصفر تغيير لون الوسم من أصفر إلى أبيض لمراح الاستراحه', 1768225368),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف ماعز جنس انثى بلون وسم أبيض ورقم 2 وعمر 36 وتاريخ ضم للمراح ديسمبر لمراح الاستراحه', 1768225564),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف ماعز جنس ذكر بلون وسم أبيض ورقم 1 وعمر 60 وتاريخ ضم للمراح ديسمبر لمراح الاستراحه', 1768225624),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف ماعز جنس انثى بلون وسم أبيض ورقم 19 وعمر 1 وتاريخ ضم للمراح 1 لمراح الاستراحه', 1768225660),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 273 ووسم رقم 19 ووسم أبيض تغيير الجنس من انثى إلى ذكر لمراح الاستراحه', 1768225712),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف ماعز جنس ذكر بلون وسم أبيض ورقم 20 وعمر 1 وتاريخ ضم للمراح 0 لمراح الاستراحه', 1768225747),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 154 ووسم رقم 21 ووسم أبيض تغيير الأم إلى 0011-أبيض لمراح الاستراحه', 1768225857),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف ماعز جنس انثى بلون وسم أبيض ورقم 8 وعمر 8 وتاريخ ضم للمراح 8 لمراح الاستراحه', 1768226010),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف ماعز جنس انثى بلون وسم أبيض ورقم 6 وعمر اكتوبر وتاريخ ضم للمراح اكتوبر لمراح الاستراحه', 1768226053),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 127 ووسم رقم 43 ووسم أخضر تغيير الملاحظات إلى مشروع فحل لمراح الاستراحه', 1768227247),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 174 ووسم رقم 43 ووسم أصفر تغيير الجنس من انثى إلى ذكر لمراح الاستراحه', 1768227952),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 69 ووسم أزرق تغيير رقم الوسم إلى 50 حذف تاريخ الضم للمراح قبل عامين و 3 أشهر لمراح الاستراحه', 1768228805),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 68 ووسم أزرق تغيير رقم الوسم إلى 51 لمراح الاستراحه', 1768228832),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 68 بوسم 51 أزرق بوصف موت ولادة مفردة حليبها فير صالح لمراح الاستراحه', 1765636890),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 69 بوسم 50 أزرق بوصف ولادة مفردة زخله لمراح الاستراحه', 1768142523),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 174 ووسم رقم 43 ووسم أصفر تغيير العمر من 5 أشهر إلى 6 أشهر تغيير تاريخ الضم للمراح من قبل 5 أشهر إلى قبل 6 أشهر لمراح الاستراحه', 1768229025),
	(NULL, $newuserid, 2, 'mrah', 'إضافة مراح', 'تم إضافة مراح بإسم الغنم', 1768249066),
	(NULL, $newuserid, 2, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف حري جنس انثى لمراح الغنم', 1768249125),
	(NULL, $newuserid, 2, 'purchase', 'إضافة مشتريات أعلاف جديده', 'تم إضافة مشتريات أعلاف جديده 50 كيس شعير 50 كيلو لمراح الغنم بتكلفه فرديه 72 ريال وتكلفة إجماليه 3600 ريال تم سدادها بالكامل', 1768249166),
	(NULL, $newuserid, 2, 'feed', 'إضافة كمية أعلاف جديده', 'بسبب إضافة مشتريات أعلاف جديده تم إضافة كمية أعلاف جديده شعير 50 كيلو بمقدار 50 كيس وتكلفة فرديه 72 ريال لمراح الغنم', 1768249166),
	(NULL, $newuserid, 2, 'feed', 'تحديث الاستهلاك اليومي للعلف', 'تم تحديث الاستهلاك اليومي للعلف شعير 50 كيلو إلى 2 كيس يومياً', 1768249199),
	(NULL, $newuserid, 3, 'mrah', 'إضافة مراح', 'تم إضافة مراح بإسم مراح المحمد ', 1768250141),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 158 ووسم رقم 4 ووسم أصفر مضاف عن طريق الخطأ لمراح الاستراحه', 1768264615),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 246 ووسم أصفر مضاف عن طريق الخطأ لمراح الاستراحه', 1768264625),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 252 ووسم أصفر مضاف عن طريق الخطأ لمراح الاستراحه', 1768264634),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 258 ووسم أصفر مضاف عن طريق الخطأ لمراح الاستراحه', 1768264643),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 259 ووسم أصفر مضاف عن طريق الخطأ لمراح الاستراحه', 1768264650),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 264 ووسم بلا وسم مضاف عن طريق الخطأ لمراح الاستراحه', 1768264662),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف نجدي جنس ذكر لمراح الاستراحه', 1768265587),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حلال بالجمله', 'تم إضافة عدد 3 رأس غنم صنف نعيمي جنس ذكر لمراح الاستراحه', 1768265632),
	(NULL, $newuserid, $newmrahid, 'opex', 'إضافة تكلفه تشغيليه', 'تم إضافة تكلفه تشغيليه بشكل شهري بوصف راتب صباح الخير بمبلغ 1500 ريال لشهر يناير من العام 2026 لمراح الاستراحه', 1768509138),
	(NULL, $newuserid, $newmrahid, 'opex', 'إضافة تكلفه تشغيليه', 'تم إضافة تكلفه تشغيليه بشكل شهري بوصف راتب صباح الخير بمبلغ 1500 ريال لشهر ديسمبر من العام 2025 لمراح الاستراحه', 1768509156),
	(NULL, $newuserid, $newmrahid, 'opex', 'إضافة تكلفه تشغيليه', 'تم إضافة تكلفه تشغيليه بشكل شهري بوصف راتب صباح الخير بمبلغ 1500 ريال لشهر نوفمبر من العام 2025 لمراح الاستراحه', 1768509168),
	(NULL, $newuserid, $newmrahid, 'opex', 'إضافة تكلفه تشغيليه', 'تم إضافة تكلفه تشغيليه بشكل شهري بوصف راتب صباح الخير بمبلغ 1500 ريال لشهر اكتوبر من العام 2025 لمراح الاستراحه', 1768509180),
	(NULL, $newuserid, $newmrahid, 'opex', 'إضافة تكلفه تشغيليه', 'تم إضافة تكلفه تشغيليه بشكل شهري بوصف راتب صباح الخير بمبلغ 1500 ريال لشهر سبتمبر من العام 2025 لمراح الاستراحه', 1768509193),
	(NULL, $newuserid, $newmrahid, 'opex', 'إضافة تكلفه تشغيليه', 'تم إضافة تكلفه تشغيليه بشكل شهري بوصف راتب صباح الخير بمبلغ 1500 ريال لشهر اغسطس من العام 2025 لمراح الاستراحه', 1768509207),
	(NULL, $newuserid, $newmrahid, 'opex', 'إضافة تكلفه تشغيليه', 'تم إضافة تكلفه تشغيليه بشكل شهري بوصف راتب صباح الخير بمبلغ 1500 ريال لشهر يوليو من العام 2025 لمراح الاستراحه', 1768509218),
	(NULL, $newuserid, $newmrahid, 'supplier', 'حذف بائع أعلاف', 'تم حذف البائع  مورد برسيم برقم جوال   وباجمالي مشتريات  700 ريال تم دقع0 ريال منها فقط', 1768509284),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث علف يدوياً', 'تم تحديث العلف يدوياً شعير 50 كيلو بمعرف رقم 1 بنغيير الكميه من 2 إلى 200 كيس', 1768509303),
	(NULL, $newuserid, $newmrahid, 'purchase', 'حذف مشتريات أعلاف', 'تم حذف مشترى 10 كيس شعير 50 كيلو لمراح الاستراحه بتكلفه فرديه 70 ريال وتكلفة إجماليه 700 ريال مدينه بالكامل للبائع مورد برسيم ورقمه ', 1768509320),
	(NULL, $newuserid, $newmrahid, 'feed', 'تعديل كمية علف', 'بسبب حذف مشتريات تم تعديل كمية العلف شعير 50 كيلو من 200 إلى 190 كيس لمراح الاستراحه', 1768509320),
	(NULL, $newuserid, $newmrahid, 'purchase', 'إضافة مشتريات أعلاف جديده', 'تم إضافة مشتريات أعلاف جديده 571 كيس شعير 50 كيلو لمراح الاستراحه بتكلفه فرديه 70 ريال وتكلفة إجماليه 39970 ريال تم سدادها بالكامل للبائع مورد شعير', 1768509580),
	(NULL, $newuserid, $newmrahid, 'feed', 'إضافة كمية أعلاف جديده', 'بسبب إضافة مشتريات أعلاف جديده تم تعديل كمية العلف شعير 50 كيلو من 190 إلى 761 كيس لمراح الاستراحه', 1768509580),
	(NULL, $newuserid, $newmrahid, 'suppliers', 'إضافة بائع أعلاف', 'تم إضافة بائع أعلاف بإسم مورد شعير ورقم جوال  لمراح الاستراحه', 1768509580),
	(NULL, $newuserid, $newmrahid, 'purchase', 'إضافة مشتريات أعلاف جديده', 'تم إضافة مشتريات أعلاف جديده 1000 بلكه برسيم لمراح الاستراحه بتكلفه فرديه 17 ريال وتكلفة إجماليه 17000 ريال تم سدادها بالكامل للبائع مورد برسيم', 1768509628),
	(NULL, $newuserid, $newmrahid, 'feed', 'إضافة كمية أعلاف جديده', 'بسبب إضافة مشتريات أعلاف جديده تم إضافة كمية أعلاف جديده برسيم بمقدار 1000 بلكه وتكلفة فرديه 17 ريال لمراح الاستراحه', 1768509628),
	(NULL, $newuserid, $newmrahid, 'suppliers', 'إضافة بائع أعلاف', 'تم إضافة بائع أعلاف بإسم مورد برسيم ورقم جوال  لمراح الاستراحه', 1768509628),
	(NULL, $newuserid, $newmrahid, 'purchase', 'إضافة مشتريات أعلاف جديده', 'تم إضافة مشتريات أعلاف جديده 532 بلكه تبن لمراح الاستراحه بتكلفه فرديه 13 ريال وتكلفة إجماليه 6916 ريال تم سدادها بالكامل للبائع مورد تبن', 1768509880),
	(NULL, $newuserid, $newmrahid, 'feed', 'إضافة كمية أعلاف جديده', 'بسبب إضافة مشتريات أعلاف جديده تم إضافة كمية أعلاف جديده تبن بمقدار 532 بلكه وتكلفة فرديه 13 ريال لمراح الاستراحه', 1768509880),
	(NULL, $newuserid, $newmrahid, 'suppliers', 'إضافة بائع أعلاف', 'تم إضافة بائع أعلاف بإسم مورد تبن ورقم جوال  لمراح الاستراحه', 1768509880),
	(NULL, $newuserid, $newmrahid, 'mrah', 'إضافة أرباح سابقه', 'تم إضافة أرباح سابقه بقيمة قدرها 37700 ريال لمراح الاستراحه بمعرف رقم 1', 1768510013),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث الاستهلاك اليومي للعلف', 'تم تحديث الاستهلاك اليومي للعلف برسيم إلى 3 بلكه يومياً', 1768531641),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث الاستهلاك اليومي للعلف', 'تم تحديث الاستهلاك اليومي للعلف تبن إلى 3 بلكه يومياً', 1768531643),
	(NULL, $newuserid, $newmrahid, 'water', 'تحديث الاستهلاك اليومي للمياه', 'تم تحديث الاستهلاك اليومي للمياه إلى 3000 لتر يومياً', 1768532270),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث الاستهلاك اليومي للعلف', 'تم تحديث الاستهلاك اليومي للعلف برسيم من 3 بلكه يومياً إلى 4 بلكه يومياً', 1768635861),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث الاستهلاك اليومي للعلف', 'تم تحديث الاستهلاك اليومي للعلف تبن من 3 بلكه يومياً إلى 2 بلكه يومياً', 1768635888),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث الاستهلاك اليومي للعلف', 'تم تحديث الاستهلاك اليومي للعلف برسيم من 4 بلكه يومياً إلى 4.25 بلكه يومياً', 1768635979),
	(NULL, $newuserid, $newmrahid, 'water', 'تحديث الاستهلاك اليومي للمياه', 'تم تحديث الاستهلاك اليومي للمياه من 3000 لتر يومياً إلى 1400 لتر يومياً', 1768636044),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف حري جنس انثى بلون وسم أخضر ورقم 49 وعمر 48 وملاحظات لم تلد ابدا وتاريخ ضم للمراح ديسمبر لمراح الاستراحه', 1768650943),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف حري جنس ذكر بلون وسم أخضر ورقم 50 مولود في المراح  وعمر 3 وملاحظات فحل مسلتقبلي وتاريخ ضم للمراح 3 لمراح الاستراحه', 1768650980),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 13 بوسم 13 أزرق بوصف 13 أزرق مباع لمراح الاستراحه', 1768434112),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 13 ووسم رقم 13 ووسم أزرق حذف رقم الوسم 13 حذف لون الوسم أزرق تغييرها إلى أصل رأس المال  تغيير العمر من شهر إلى شهر لمراح الاستراحه', 1768693362),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 13 ووسم أزرق حذف لون الوسم أزرق لمراح الاستراحه', 1768694025),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 13 تغيير رقم الوسم إلى 13 تغيير لون الوسم إلى أزرق لمراح الاستراحه', 1768694272),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 13 ووسم رقم 13 ووسم أزرق بتغيير حالته إلى مباع بقيمة سوقية تقدر بـ 1000 ريال لمراح الاستراحه', 1768694291),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 35 ووسم رقم 35 ووسم أزرق بتغيير حالته إلى مباع بقيمة سوقية تقدر بـ 1000 ريال لمراح الاستراحه', 1768694390),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 76 ووسم رقم 6 ووسم أحمر بتغيير حالته إلى مباع بقيمة سوقية تقدر بـ 1000 ريال لمراح الاستراحه', 1768694422),
	(NULL, $newuserid, $newmrahid, 'mrah', 'إضافة أرباح سابقه', 'تم إضافة أرباح سابقه بقيمة قدرها 34700 ريال لمراح الاستراحه بمعرف رقم 1', 1768696515),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث علف يدوياً', 'تم تحديث العلف يدوياً شعير 50 كيلو بمعرف رقم 1 بنغيير الكميه من 755 إلى 13 كيس', 1768831882),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث علف يدوياً', 'تم تحديث العلف يدوياً برسيم بمعرف رقم 3 بنغيير الكميه من 572.25 إلى 3 بلكه', 1768917609),
	(NULL, $newuserid, $newmrahid, 'purchase', 'إضافة مشتريات أعلاف جديده', 'تم إضافة مشتريات أعلاف جديده 257 بلكه برسيم لمراح الاستراحه بتكلفه فرديه 17.5 ريال وتكلفة إجماليه 4497.5 ريال مدينه بالكامل للبائع مورد تبن', 1768917658),
	(NULL, $newuserid, $newmrahid, 'feed', 'إضافة كمية أعلاف جديده', 'بسبب إضافة مشتريات أعلاف جديده تم تعديل كمية العلف برسيم من 3 إلى 260 بلكه والسعر من 17 ريال إلى 17.49 ريال لمراح الاستراحه', 1768917658),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث علف يدوياً', 'تم تحديث العلف يدوياً شعير 50 كيلو بمعرف رقم 1 بنغيير الكميه من 9 إلى 11 كيس', 1768989074),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 75 ووسم رقم 5 ووسم أحمر بتغيير حالته إلى مباع بقيمة سوقية تقدر بـ 1000 ريال لمراح الاستراحه', 1769003929),
	(NULL, $newuserid, $newmrahid, 'purchase', 'إضافة مشتريات مياه', 'تم إضافة مشتريات مياه جديده 12000 لتر لمراح الاستراحه بتكلفه فرديه 0.0083 ريال لكل لتر وتكلفة إجماليه 100 ريال تم سدادها بالكامل للبائع مورد المياه', 1769005829),
	(NULL, $newuserid, $newmrahid, 'water', 'إضافة كمية مياه', 'بسبب إضافة مشتريات مياه جديده تم تعديل كمية مياه من 21400 إلى 33400 لتر والسعر من 0.0133 ريال إلى 0.012 ريال لمراح الاستراحه', 1769005829),
	(NULL, $newuserid, $newmrahid, 'suppliers', 'إضافة بائع مياه', 'تم إضافة بائع مياه بإسم مورد المياه ورقم جوال  لمراح الاستراحه', 1769005829),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث علف يدوياً', 'تم تحديث العلف يدوياً تبن بمعرف رقم 4 بنغيير الكميه من 519 إلى 200 بلكه', 1769015796),
	(NULL, $newuserid, $newmrahid, 'mrah', 'إضافة أرباح سابقه', 'تم إضافة أرباح سابقه بقيمة قدرها 33700 ريال لمراح الاستراحه بمعرف رقم 1', 1769018207),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 244 ووسم أصفر بتغيير حالته إلى نافق بقيمة سوقية تقدر بـ 1000 ريال لمراح الاستراحه', 1769161998),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 244 ووسم أصفر تغيير الحاله الصحيه من نافق إلى سليم تغيير رقم الوسم إلى 17 حذف تاريخ الضم للمراح قبل 4 أعوام لمراح الاستراحه', 1769181979),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 244 ووسم رقم 17 ووسم أصفر بتغيير حالته إلى نافق بقيمة سوقية تقدر بـ 1000 ريال لمراح الاستراحه', 1769182023),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 7 ووسم رقم 7 ووسم أزرق بتغيير حالته إلى مباع بقيمة سوقية تقدر بـ 1000 ريال لمراح الاستراحه', 1769345506),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 12 ووسم رقم 12 ووسم أزرق بتغيير حالته إلى مباع بقيمة سوقية تقدر بـ 1000 ريال لمراح الاستراحه', 1769345547),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث علف يدوياً', 'تم تحديث العلف يدوياً شعير 50 كيلو بمعرف رقم 1 بنغيير الكميه من 3 إلى 1 كيس', 1769345645),
	(NULL, $newuserid, $newmrahid, 'purchase', 'تحديث حالة الدفع لمشتريات أعلاف', 'تم تحديث حالة الدفع لمشترى 257 بلكه للعلف برسيم بمعرف رقم 7 من مدين بالكامل بمقدار 0 ريال إلى سداد جزئي بمقدار 2000 ريال للبائع مورد تبن', 1769415147),
	(NULL, $newuserid, $newmrahid, 'purchase', 'إضافة مشتريات أعلاف جديده', 'تم إضافة مشتريات أعلاف جديده 50 كيس شعير 50 كيلو لمراح الاستراحه بتكلفه فرديه 72 ريال وتكلفة إجماليه 3600 ريال تم سدادها بالكامل للبائع مورد شعير', 1769415252),
	(NULL, $newuserid, $newmrahid, 'feed', 'إضافة كمية أعلاف جديده', 'بسبب إضافة مشتريات أعلاف جديده تم تعديل كمية العلف شعير 50 كيلو من 0 إلى 50 كيس والسعر من 70 ريال إلى 72 ريال لمراح الاستراحه', 1769415252),
	(NULL, $newuserid, $newmrahid, 'purchase', 'إضافة مشتريات أعلاف جديده', 'تم إضافة مشتريات أعلاف جديده 10 كيس نخاله 50 كيلو لمراح الاستراحه بتكلفه فرديه 49 ريال وتكلفة إجماليه 490 ريال تم سدادها بالكامل للبائع مورد شعير', 1769461284),
	(NULL, $newuserid, $newmrahid, 'feed', 'إضافة كمية أعلاف جديده', 'بسبب إضافة مشتريات أعلاف جديده تم إضافة كمية أعلاف جديده نخاله 50 كيلو بمقدار 10 كيس وتكلفة فرديه 49 ريال لمراح الاستراحه', 1769461284),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 45 ووسم رقم 45 ووسم أزرق بتغيير حالته إلى نافق بقيمة سوقية تقدر بـ 800 ريال لمراح الاستراحه', 1769521875),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث الاستهلاك اليومي للعلف', 'تم تحديث الاستهلاك اليومي للعلف نخاله 50 كيلو إلى 1 كيس يومياً', 1769549916),
	(NULL, $newuserid, $newmrahid, 'mrah', 'إضافة أرباح سابقه', 'تم إضافة أرباح سابقه بقيمة قدرها 0 ريال لمراح الاستراحه بمعرف رقم 1', 1769552480),
	(NULL, $newuserid, $newmrahid, 'opex', 'إضافة تكلفه تشغيليه', 'تم إضافة تكلفه تشغيليه بشكل شهري بوصف راتب صباح الخير بمبلغ 1500 ريال لشهر فبراير من العام 2026 لمراح الاستراحه', 1769998713),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 652 بوسم 53 أصفر بوصف ولادة رباعية ٣ رخال وطلي لمراح الاستراحه', 1762265123),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 635 ووسم رقم 36 ووسم أصفر تغيير الملاحظات إلى فحل مستقبلي لمراح الاستراحه', 1770041561),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 635 ووسم رقم 36 ووسم أصفر تغيير الجنس من انثى إلى ذكر لمراح الاستراحه', 1770041585),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 65 بوسم 65 أزرق بوصف إصابة بمرض عينها اليسرى لمراح الاستراحه', 1767450088),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 621 ووسم رقم 22 ووسم أصفر بتغيير حالته إلى نافق بقيمة سوقية تقدر بـ 800 ريال لمراح الاستراحه', 1770042577),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 432 بوسم 33 أخضر بوصف موت ولادة مفردة لمراح الاستراحه', 1769691971),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 2 بوسم 2 أزرق بوصف ولادة مفردة لمراح الاستراحه', 1762348444),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 662 بوسم 63 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1762348490),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 654 بوسم 55 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1757164530),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 660 بوسم 61 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1751981095),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 206 بوسم 7 أحمر بوصف ولادة توأم لمراح الاستراحه', 1764978999),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 206 بوسم 7 أحمر بوصف ولادة توأم لمراح الاستراحه', 1752019049),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 510 ووسم رقم 16 ووسم أبيض تغيير العمر من عام و شهر إلى 8 أشهر حذف تاريخ الضم للمراح قبل عام و شهر لمراح الاستراحه', 1770209418),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 52 بوسم 52 أزرق بوصف ولادة مفردة لمراح الاستراحه', 1759842102),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 433 بوسم 34 أخضر بوصف ولادة مفردة لمراح الاستراحه', 1762434142),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 639 بوسم 40 أصفر بوصف ولادة توأم لمراح الاستراحه', 1762434223),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 439 بوسم 40 أخضر بوصف ولادة مفردة لمراح الاستراحه', 1757250273),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 20 بوسم 20 أزرق بوصف ولادة مفردة لمراح الاستراحه', 1762434331),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 650 بوسم 51 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1739106579),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 650 بوسم 51 أصفر بوصف موت ولادة مفردة لمراح الاستراحه', 1762434625),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 661 بوسم 62 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1762434702),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 443 بوسم 44 أخضر بوصف ولادة مفردة لمراح الاستراحه', 1759842750),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 647 بوسم 48 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1762434841),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 645 بوسم 46 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1765026914),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 424 ووسم رقم 25 ووسم أخضر تغيير الملاحظات إلى لم نلد حذف تاريخ الضم للمراح قبل عام و شهر لمراح الاستراحه', 1770210975),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 684 بوسم 85 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1765027034),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 638 بوسم 39 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1759843055),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 675 بوسم 76 أصفر بوصف موت ولادة مفردة لمراح الاستراحه', 1765027155),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 641 بوسم 42 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1762435179),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 431 بوسم 32 أخضر بوصف ولادة مفردة لمراح الاستراحه', 1744291248),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 640 بوسم 41 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1757251275),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 429 بوسم 30 أخضر بوصف ولادة مفردة لمراح الاستراحه', 1754659302),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث الاستهلاك اليومي للعلف', 'تم تحديث الاستهلاك اليومي للعلف برسيم من 4.25 بلكه يومياً إلى 5 بلكه يومياً', 1770213393),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث الاستهلاك اليومي للعلف', 'تم تحديث الاستهلاك اليومي للعلف تبن من 2 بلكه يومياً إلى 3 بلكه يومياً', 1770213441),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 642 بوسم 43 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1759846671),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 646 بوسم 47 أصفر بوصف ولادة مفردة لمراح الاستراحه', 1757254695),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 446 بوسم 47 أخضر بوصف ولادة مفردة لمراح الاستراحه', 1759846901),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة رأس حلال', 'تم إضافة رأس غنم صنف ماعز جنس انثى بلون وسم أبيض ورقم 13 وعمر اكتوبر وتاريخ ضم للمراح 4 لمراح الاستراحه', 1770215096),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 5 بوسم 5 أزرق بوصف ولادة مفردة لمراح الاستراحه', 1762439356),
	(NULL, $newuserid, $newmrahid, 'feed', 'تحديث علف يدوياً', 'تم تحديث العلف يدوياً برسيم بمعرف رقم 3 بنغيير الكميه من 191.25 إلى 189 بلكه', 1770223994),
	(NULL, $newuserid, 0, 'users', 'تحديث القيمة السوقية للأغنام', 'تم تحديث القيمة السوقية للأغنام', 1770333738),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف رأس حلال', 'تم حذف رأس أغنام بمعرف رقم 100 ووسم رقم 100 ووسم أزرق بتغيير حالته إلى نافق بقيمة سوقية تقدر بـ 1000 ريال لمراح الاستراحه', 1770383642),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 51 ووسم رقم 50 ووسم أزرق تغيير العمر من 3 أعوام و 4 أشهر إلى 7 أشهر حذف تاريخ الضم للمراح قبل عامين و شهر لمراح الاستراحه', 1770559760),
	(NULL, $newuserid, $newmrahid, 'sheep', 'حذف حدث فردي', 'تم حذف حدث لرأس غنم بمعرف رقم 51 بوسم 50 أزرق لمراح الاستراحه', 1770559778),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 4 بوسم 4 أزرق بوصف ولادة مفردة لمراح الاستراحه', 1760191798),
	(NULL, $newuserid, $newmrahid, 'sheep', 'تحديث رأس حلال', 'تم تحديث رأس غنم بمعرف رقم 655 ووسم رقم 56 ووسم أصفر تغيير العمر من شهر إلى 10 أشهر لمراح الاستراحه', 1770559994),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 22 بوسم 22 أزرق بوصف ولادة مفردة رحله لمراح الاستراحه', 1762784125),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 682 بوسم 83 أصفر بوصف ولادة مفردة طلي لمراح الاستراحه', 1760192212),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 65 بوسم 65 أزرق بوصف ولادة مفردة لمراح الاستراحه', 1760278945),
	(NULL, $newuserid, $newmrahid, 'sheep', 'إضافة حدث فردي', 'تم إضافة حدث لرأس غنم بمعرف رقم 672 بوسم 73 أصفر بوصف ولادة مفردة رخله لمراح الاستراحه', 1760278991),
	(NULL, $newuserid, $newmrahid, 'purchase', 'إضافة مشتريات مواد اخرى', 'تم إضافة مشتريات تطعيمات جديده بوصف الالتهاب الرئوي وكمية 250 ميلي لتر بتكلفه فرديه 0.56 ريال وتكلفة إجماليه 140 ريال تم سدادها بالكامل للبائع البيطري رقم جوال 0555555555 لمراح الاستراحه', 1770686679),
	(NULL, $newuserid, $newmrahid, 'suppliers', 'إضافة بائع مواد اخرى', 'تم إضافة بائع مواد اخزى بإسم البيطري ورقم جوال 0555555555 لمراح الاستراحه', 1770686679),
	(NULL, $newuserid, $newmrahid, 'purchase', 'إضافة مشتريات مواد اخرى', 'تم إضافة مشتريات معادن جديده بوصف بلك معادن متنوعه وكمية 5 كقم بتكلفه فرديه 5 ريال وتكلفة إجماليه 25 ريال مدينه بالكامل للبائع البيطري رقم جوال 0555555555 لمراح الاستراحه', 1770686741),
	(NULL, $newuserid, $newmrahid, 'suppliers', 'إضافة بائع مواد اخرى', 'تم إضافة بائع مواد اخزى بإسم البيطري ورقم جوال 0555555555 لمراح الاستراحه', 1770686741),
	(NULL, $newuserid, $newmrahid, 'capex', 'إضافة تكلفه رأسماليه', 'تم إضافة تكلفه رأس ماليه بوصف 5 معالف بطول 2 متر ومبلغ 1250 ريال لمراح الاستراحه', 1770686784),
	(NULL, $newuserid, $newmrahid, 'capex', 'إضافة تكلفه رأسماليه', 'تم إضافة تكلفه رأس ماليه بوصف 3 شبوك بطول 20 متر وارتفاع مترين ومبلغ 600 ريال لمراح الاستراحه', 1770686824),
	(NULL, $newuserid, $newmrahid, 'opex', 'إضافة تكلفه تشغيليه', 'تم إضافة تكلفه تشغيليه بشكل شهري بوصف فاتورة الكهرباء بمبلغ 360 ريال لشهر فبراير من العام 2026 لمراح الاستراحه', 1770686852),
	(NULL, $newuserid, $newmrahid, 'opex', 'إضافة تكلفه تشغيليه', 'تم إضافة تكلفه تشغيليه بشكل سنوي بوصف ايجار الاستراحه بمبلغ 5000 ريال يبدأ من شهر سبتمبر من العام 2025 لمراح الاستراحه', 1770686882),
	(NULL, $newuserid, $newmrahid, 'mrah', 'إضافة تكاليف سابقه', 'تم إضافة تكاليف سابقه بقيمة قدرها 0 ريال لمراح الاستراحه بمعرف رقم 1', 1770686923)");
	
	$ins = mysqli_query($link,"INSERT INTO `opex` (`id`, `userid`, `mrahid`, `description`, `cycle`, `cost`, `start`, `end`, `status`, `timeadded`, `timeedited`) VALUES
	(NULL, $newuserid, $newmrahid, 'راتب الراعي', 'monthly', '1500', 1767214800, 1769893199, 'active', 1768509138, NULL),
	(NULL, $newuserid, $newmrahid, 'راتب الراعي', 'monthly', '1500', 1764536400, 1767214799, 'active', 1768509156, NULL),
	(NULL, $newuserid, $newmrahid, 'راتب الراعي', 'monthly', '1500', 1761944400, 1764536399, 'active', 1768509168, NULL),
	(NULL, $newuserid, $newmrahid, 'راتب الراعي', 'monthly', '1500', 1759266000, 1761944399, 'active', 1768509180, NULL),
	(NULL, $newuserid, $newmrahid, 'راتب الراعي', 'monthly', '1500', 1756674000, 1759265999, 'active', 1768509193, NULL),
	(NULL, $newuserid, $newmrahid, 'راتب الراعي', 'monthly', '1500', 1753995600, 1756673999, 'active', 1768509207, NULL),
	(NULL, $newuserid, $newmrahid, 'راتب الراعي', 'monthly', '1500', 1751317200, 1753995599, 'active', 1768509218, NULL),
	(NULL, $newuserid, $newmrahid, 'راتب الراعي', 'monthly', '1500', 1769893200, 1772312399, 'active', 1769998713, NULL),
	(NULL, $newuserid, $newmrahid, 'فاتورة الكهرباء', 'monthly', '360', 1769893200, 1772312399, 'active', 1770686852, NULL),
	(NULL, $newuserid, $newmrahid, 'ايجار الاستراحه', 'yearly', '5000', 1756674000, 1788209999, 'active', 1770686882, NULL)");
	
	$ins = mysqli_query($link,"INSERT INTO `purchases` (`id`, `userid`, `mrahid`, `category`, `type`, `quantity`, `unitcost`, `totalcost`, `settlement`, `paid`, `remarks`, `suppliername`, `suppliermobile`, `time`) VALUES
	(NULL, $newuserid, $newmrahid, 'water', 'water', '30000', '0.0133', '400', 'full', '400', '', '', '', 1768204542),
	(NULL, $newuserid, $newmrahid, 'feed', 'barley50', '571', '70', '39970', 'full', '39970', '', 'مقاول الماء', '0555555551', 1768509580),
	(NULL, $newuserid, $newmrahid, 'feed', 'alfalfa', '588', '17', '9996', 'partial', '7996', '', 'مورد برسيم', '0555555553', 1768509628),
	(NULL, $newuserid, $newmrahid, 'feed', 'hay', '532', '13', '6916', 'full', '6916', '', 'مورد تبن', '0555555552', 1768509880),
	(NULL, $newuserid, $newmrahid, 'feed', 'alfalfa', '257', '17.5', '4497.5', 'partial', '2000', '', 'مورد تبن', '0555555552', 1768917658),
	(NULL, $newuserid, $newmrahid, 'water', 'water', '12000', '0.0083', '100', 'full', '100', '', 'مقاول الماء', '0555555551', 1769005829),
	(NULL, $newuserid, $newmrahid, 'feed', 'barley50', '50', '72', '3600', 'full', '3600', '', 'مقاول الماء', '0555555551', 1769415252),
	(NULL, $newuserid, $newmrahid, 'feed', 'barn50', '10', '49', '490', 'full', '490', '', 'مقاول الماء', '0555555551', 1769461284),
	(NULL, $newuserid, $newmrahid, 'others', 'vaccines', '250 mililiter', '0.56', '140', 'full', '140', 'الالتهاب الرئوي', 'البيطري', '0555555555', 1770686679),
	(NULL, $newuserid, $newmrahid, 'others', 'minerals', '5 kilogram', '5', '25', 'debt', '0', 'بلك معادن متنوعه', 'البيطري', '0555555555', 1770686741)");
	
	$ins = mysqli_query($link,"INSERT INTO `sheep` (`id`, `userid`, `mrahid`, `status`, `tagnumber`, `tagcolor`, `breed`, `gender`, `born`, `age`, `weight`, `remarks`, `cost`, `inclusiondate`, `events`, `father`, `mother`, `value`, `agestamp`, `timeadded`, `timeedited`) VALUES
	(NULL, $newuserid, $newmrahid, 'live', '1', 'blue', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '2', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'ولادة مفردة^1762348444', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '3', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', '', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '4', 'blue', 'harri', 'female', 0, '37', '', '', '', '28', 'ولادة مفردة^1760191798', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '5', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'ولادة مفردة^1762439356', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '6', 'blue', 'harri', 'female', 0, '13', '', '', '', '13', '', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'sold', '7', 'blue', 'harri', 'male', 1, '1', '', '', '', '1', '', '', '', '1200', 1769785201, 1767120267, 1769345506),
	(NULL, $newuserid, $newmrahid, 'live', '8', 'blue', 'harri', 'male', 1, '4', '', '', '', '4', '', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '9', 'blue', 'harri', 'male', 1, '4', '', '', '', '4', '', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '10', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', '', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '11', 'blue', 'harri', 'female', 0, '37', '', '', '', '28', 'ولادة مفردة رخله^1761868800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'sold', '12', 'blue', 'harri', 'female', 1, '3', '', '', '', '3', '', '', '0011-blue', '1000', 1769785201, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '13', 'blue', 'harri', 'male', 1, '1', '', '', '', '2', '', '', '', '1000', 1769785201, 1767120267, 1768694291),
	(NULL, $newuserid, $newmrahid, 'live', '14', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'ولادة مفردة رخله^1764460800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '15', 'blue', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0014-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '16', 'blue', 'harri', 'female', 0, '13', '', '', '', '13', 'ولادة مفردة رخله^1764460800\r\n', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '17', 'blue', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0016-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '18', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'ولادة مفردة رخله^1764460800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '19', 'blue', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0018-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '20', 'blue', 'harri', 'female', 0, '61', '', '', '', '28', 'ولادة مفردة^1762434331', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '21', 'blue', 'harri', 'female', 1, '3', '', '', '', '3', '', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '22', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'ولادة مفردة رحله^1762784125', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '23', 'blue', 'harri', 'female', 1, '3', '', '', '', '3', '', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '24', 'blue', 'harri', 'female', 0, '37', '', '', '', '28', 'ولادة مفردة رخله^1761868800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '25', 'blue', 'harri', 'female', 1, '3', '', '', '', '3', '', '', '0024-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '26', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'ولادة مفردة رخله^1764460800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '27', 'blue', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0026-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '28', 'blue', 'harri', 'female', 0, '13', '', '', '', '13', 'ولادة مفردة رخله^1764460800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '29', 'blue', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0028-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '30', 'blue', 'harri', 'female', 0, '37', '', '', '', '28', 'ولادة مفردة رخله^1764460800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '31', 'blue', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0030-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '32', 'blue', 'harri', 'female', 0, '13', '', '', '', '13', 'ولادة مفردة رخله^1764460800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '33', 'blue', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0032-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '34', 'blue', 'harri', 'female', 0, '13', '', '', '', '13', 'ولادة مفردة طلي^1767139200', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'sold', '35', 'blue', 'harri', 'male', 1, '1', '', '', '', '1', '', '', '0034-blue', '1000', 1769785201, 1767120267, 1768694390),
	(NULL, $newuserid, $newmrahid, 'live', '36', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'ولادة مفردة رخله^1764460800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '37', 'blue', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0036-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '38', 'blue', 'harri', 'female', 0, '37', '', '', '', '28', 'ولادة مفردة رخله^1764460800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '39', 'blue', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0038-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '40', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'ولادة مفردة طلي^1764460800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '41', 'blue', 'harri', 'male', 1, '2', '', '', '', '2', '', '', '0040-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '42', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'ولادة مفردة طلي^1764460800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '43', 'blue', 'harri', 'male', 1, '2', '', '', '', '2', '', '', '0042-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '44', 'blue', 'harri', 'female', 0, '37', '', '', '', '28', 'ولادة مفردة رخله^1767139200', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'dead', '45', 'blue', 'harri', 'female', 1, '1', '', '', '', '1', '', '', '0044-blue', '800', 1769785201, 1767120267, 1769521875),
	(NULL, $newuserid, $newmrahid, 'live', '46', 'blue', 'harri', 'female', 0, '37', '', '', '', '28', 'ولادة مفردة رخله^1764460800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '47', 'blue', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0046-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '48', 'blue', 'harri', 'female', 0, '37', '', '', '', '28', 'ولادة مفردة طلي^1764460800', '', '', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '49', 'blue', 'harri', 'male', 1, '2', '', '', '', '2', '', '', '0048-blue', '', 1769785201, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '51', 'blue', 'harri', 'female', 1, '8', '', '', '', '8', 'موت ولادة مفردة حليبها غير صالح^1765636890', '', '0042-blue', '', 1770044401, 1767120267, 1768228832),
	(NULL, $newuserid, $newmrahid, 'live', '50', 'blue', 'harri', 'female', 0, '7', '', '', '', '', '', '', '', '', 1770559760, 1767120267, 1770559760),
	(NULL, $newuserid, $newmrahid, 'live', '52', 'blue', 'harri', 'female', 0, '37', '', '', '', '28', 'ولادة مفردة^1759842102,مضرع^1767991566', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '53', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'مضرع^1767991566', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '54', 'blue', 'harri', 'female', 0, '13', '', '', '', '13', 'مضرع^1767991567', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '55', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991566', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '56', 'blue', 'harri', 'female', 1, '7', '', '', '', '7', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '57', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'مضرع^1767991567', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '58', 'blue', 'harri', 'female', 1, '6', '', '', '', '6', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '59', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'ولادة مفردة طلي^1767139200', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '60', 'blue', 'harri', 'female', 0, '49', '', '', '', '28', 'مضرع^1767991566', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '61', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991567', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '62', 'blue', 'harri', 'female', 0, '49', '', '', '', '28', 'مضرع^1767991567', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '63', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'مضرع^1767991569', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '64', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'مضرع^1767991570', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '65', 'blue', 'harri', 'female', 0, '49', '', '', '', '28', 'ولادة مفردة^1760278945,إصابة بمرض عينها اليسرى^1767450088,مضرع^1767991568', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '66', 'blue', 'harri', 'female', 0, '37', '', '', '', '28', 'ولادة مفردة رخله^1767139200', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '67', 'blue', 'harri', 'female', 0, '37', '', '', '', '28', 'مضرع^1767991568', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '68', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'ولادة مفردة رخله^1767139200', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '69', 'blue', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0068-blue', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '70', 'blue', 'harri', 'female', 1, '1', '', '', '', '1', '', '', '', '', 1769526410, 1769526410, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '71', 'blue', 'harri', 'female', 1, '1', '', '', '', '1', '', '', '0066-blue', '', 1769526410, 1769526410, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '72', 'blue', 'harri', 'male', 1, '1', '', '', '', '1', '', '', '0059-blue', '', 1769526410, 1769526410, NULL),
	(NULL, $newuserid, $newmrahid, 'dead', '100', 'blue', 'harri', 'male', 1, '2', '', 'فحل مستقبلي', '', '2', '', '', '', '1000', 1770044401, 1767120267, 1770383642),
	(NULL, $newuserid, $newmrahid, 'sold', '500', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1050', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '501', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1050', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '502', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1050', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '503', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1050', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '504', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1050', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '505', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1100', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '506', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1100', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '507', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '508', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '509', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '510', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '511', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '512', 'blue', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'live', '101', 'blue', 'harri', 'female', 0, '25', '', '', '', '25', 'ولادة توأم^1765303600', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '102', 'blue', 'harri', 'male', 1, '2', '', 'مولوده توأم', '', '2', '', '', '0001-red', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '103', 'blue', 'harri', 'female', 1, '2', '', 'مولوده توأم', '', '2', '', '', '0001-red', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '104', 'blue', 'harri', 'female', 0, '37', '', '', '', '28', 'ولادة توأم^1762711600', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'sold', '105', 'blue', 'harri', 'male', 1, '3', '', 'مولوده توأم', '', '3', '', '', '0004-red', '1000', 1770044401, 1767120267, 1769003929),
	(NULL, $newuserid, $newmrahid, 'sold', '106', 'blue', 'harri', 'male', 1, '3', '', 'مولوده توأم', '', '3', '', '', '0004-red', '1000', 1770044401, 1767120267, 1768694422),
	(NULL, $newuserid, $newmrahid, 'live', '107', 'blue', 'harri', 'female', 0, '37', '', 'twin double', '', '28', 'ولادة توأم^1752019049,ولادة توأم^1764978999', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '108', 'blue', 'harri', 'female', 1, '8', '', 'مولوده توأم', '', '8', '', '', '0007-red', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '109', 'blue', 'harri', 'female', 1, '8', '', 'مولوده توأم', '', '8', '', '', '0007-red', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '110', 'blue', 'harri', 'female', 1, '2', '', 'مولوده توأم', '', '2', '', '', '0007-red', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '111', 'blue', 'harri', 'female', 1, '2', '', 'مولوده توأم', '', '2', '', '', '0007-red', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '143', 'blue', 'harri', 'female', 1, '6', '', '', '', '6', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '236', 'blue', 'harri', 'female', 0, '13', '', '', '', '13', 'مضرع^1767991568', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '237', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991568', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '238', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991569', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '240', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991570', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '243', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991571', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '246', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991572', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '248', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991573', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '252', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991574', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '254', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991575', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '258', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991576', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '261', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991577', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '264', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991586', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '268', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991586', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '271', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991586', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '275', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991586', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '279', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991586', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '282', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991586', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '284', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991586', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '287', 'blue', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991586', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '290', 'blue', 'harri', 'female', 1, '7', '', '', '', '7', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '299', 'blue', 'harri', 'female', 0, '13', '', '', '', '13', 'مضرع^1767991569', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '1', 'green', 'harri', 'female', 0, '49', '', '', '', '13', 'ولادة مفردة^1767991569', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '2', 'green', 'harri', 'male', 1, '2', '', '', '', '2', '', '', '0001-green', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '3', 'green', 'harri', 'female', 0, '37', '', '', '', '13', 'مضرع^1767991570', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '4', 'green', 'harri', 'female', 0, '37', '', '', '', '13', 'ولادة مفردة^1767991569', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '5', 'green', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0004-green', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '6', 'green', 'harri', 'female', 0, '37', '', '', '', '13', 'ولادة مفردة^1767991569', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '7', 'green', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0006-green', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '8', 'green', 'harri', 'female', 0, '49', '', '', '', '13', 'ولادة مفردة^1767991569', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '9', 'green', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0008-green', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '10', 'green', 'harri', 'female', 0, '25', '', '', '', '13', 'ولادة مفردة^1767991569', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '11', 'green', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0010-green', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '12', 'green', 'harri', 'female', 0, '37', '', '', '', '13', 'ولادة توأم^1765303600', '', '', '', 1770044401, 1767120267, 1768224564),
	(NULL, $newuserid, $newmrahid, 'live', '13', 'green', 'harri', 'female', 1, '2', '', 'مولوده توأم', '', '2', '', '', '0012-green', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '14', 'green', 'harri', 'female', 1, '2', '', 'مولوده توأم', '', '2', '', '', '0012-green', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '15', 'green', 'harri', 'female', 0, '49', '', '', '', '13', 'ولادة توأم^1765303600', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '16', 'green', 'harri', 'female', 1, '2', '', 'مولوده توأم', '', '2', '', '', '0015-green', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '17', 'green', 'harri', 'female', 1, '2', '', 'مولوده توأم', '', '2', '', '', '0015-green', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '18', 'green', 'harri', 'female', 0, '37', '', '', '', '13', 'ولادة توأم^1765303600', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '19', 'green', 'harri', 'female', 1, '3', '', 'مولوده توأم', '', '3', '', '', '0018-green', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '20', 'green', 'harri', 'male', 1, '3', '', 'مولوده توأم', '', '3', '', '', '0018-green', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '21', 'green', 'harri', 'female', 0, '25', '', '', '', '13', 'ولادة مفردة^1767991569', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '22', 'green', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '0021-green', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '23', 'green', 'harri', 'female', 0, '49', '', '', '', '13', 'ولادة مفردة^1767991569', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '24', 'green', 'harri', 'male', 1, '2', '', '', '', '2', '', '', '0023-green', '', 1770044401, 1767120267, 1768227247),
	(NULL, $newuserid, $newmrahid, 'live', '25', 'green', 'harri', 'female', 0, '49', '', 'لم نلد', '', '', '', '', '', '', 1770044401, 1767120267, 1770210975),
	(NULL, $newuserid, $newmrahid, 'live', '26', 'green', 'harri', 'female', 1, '6', '', '', '', '6', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '27', 'green', 'harri', 'female', 1, '8', '', '', '', '8', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '28', 'green', 'harri', 'female', 1, '8', '', '', '', '8', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '29', 'green', 'harri', 'female', 0, '11', '', '', '', '11', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '30', 'green', 'harri', 'female', 0, '49', '', '', '', '13', 'ولادة مفردة^1754659302', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '31', 'green', 'harri', 'female', 1, '6', '', 'نجديه', '', '6', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '32', 'green', 'harri', 'female', 0, '37', '', '', '', '13', 'ولادة مفردة^1744291248,مضرع^1767991586', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '33', 'green', 'harri', 'female', 0, '37', '', '', '', '13', 'مضرع^1767991586,موت ولادة مفردة^1769691971', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '34', 'green', 'harri', 'female', 0, '49', '', '', '', '13', 'ولادة مفردة^1762434142,مضرع^1767991586', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '35', 'green', 'harri', 'female', 0, '49', '', '', '', '13', 'مضرع^1767991586', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '36', 'green', 'harri', 'female', 1, '8', '', '', '', '8', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '37', 'green', 'harri', 'male', 0, '37', '', 'فحل', '', '13', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '38', 'green', 'harri', 'female', 1, '8', '', '', '', '8', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '39', 'green', 'harri', 'female', 1, '8', '', '', '', '8', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '40', 'green', 'harri', 'female', 0, '49', '', '', '', '13', 'ولادة مفردة^1757250273', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '41', 'green', 'harri', 'female', 0, '37', '', '', '', '13', 'مضرع^1767991570', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '42', 'green', 'harri', 'female', 1, '8', '', '', '', '8', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '43', 'green', 'harri', 'female', 1, '6', '', '', '', '6', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '44', 'green', 'harri', 'female', 0, '37', '', '', '', '13', 'ولادة مفردة^1759842750', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '45', 'green', 'harri', 'female', 1, '8', '', '', '', '8', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '46', 'green', 'harri', 'female', 0, '11', '', '', '', '11', 'مضرع^1767991576', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '47', 'green', 'harri', 'female', 0, '49', '', '', '', '13', 'ولادة مفردة^1759846901,مضرع^1767991576', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '48', 'green', 'harri', 'female', 1, '8', '', '', '', '8', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '49', 'green', 'harri', 'female', 0, '48', '', 'لم تلد ابدا', '', '12', '', '', '', '', 1768650943, 1768650943, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '50', 'green', 'harri', 'male', 1, '3', '', 'فحل مستقبلي', '', '3', '', '', '', '', 1768650980, 1768650980, NULL),
	(NULL, $newuserid, $newmrahid, 'sold', '500', 'green', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '501', 'green', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '502', 'green', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'live', '1', 'white', 'goat', 'male', 0, '60', '', '', '', '12', '', '', '', '', 1768225624, 1768225624, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '2', 'white', 'goat', 'female', 0, '36', '', '', '', '12', '', '', '', '', 1768225564, 1768225564, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '4', 'white', 'goat', 'female', 0, '11', '', '', '', '10', '', '', '', '', 1768225090, 1768225090, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '5', 'white', 'goat', 'female', 0, '13', '', '', '', '13', 'مضرع^1767991572', '', '', '', 1770044401, 1767120267, 1768225259),
	(NULL, $newuserid, $newmrahid, 'live', '6', 'white', 'goat', 'female', 0, '11', '', '', '', '10', '', '', '', '', 1768226053, 1768226053, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '8', 'white', 'goat', 'female', 0, '9', '', '', '', '8', '', '', '', '', 1768226010, 1768226010, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '10', 'white', 'goat', 'female', 0, '24', '', '', '', '12', '', '', '', '', 1768225017, 1768225017, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '11', 'white', 'goat', 'female', 0, '48', '', '', '', '12', '', '', '', '', 1768225144, 1768225144, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '13', 'white', 'goat', 'female', 0, '10', '', '', '', '4', '', '', '', '', 1770215096, 1770215096, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '14', 'white', 'goat', 'female', 0, '11', '', '', '', '10', '', '', '', '', 1768225321, 1768225321, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '15', 'white', 'goat', 'female', 0, '11', '', '', '', '10', '', '', '', '', 1768225338, 1768225338, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '16', 'white', 'goat', 'female', 0, '8', '', '', '', '', 'مضرع^1767991571', '', '', '', 1770209418, 1767120267, 1770209418),
	(NULL, $newuserid, $newmrahid, 'live', '17', 'white', 'goat', 'female', 0, '12', '', '', '', '12', '', '', '', '', 1770044401, 1767120267, 1768225235),
	(NULL, $newuserid, $newmrahid, 'live', '18', 'white', 'goat', 'female', 0, '12', '', '', '', '12', 'مضرع^1767991587', '', '', '', 1770044401, 1767120267, 1768225368),
	(NULL, $newuserid, $newmrahid, 'live', '19', 'white', 'goat', 'male', 1, '2', '', '', '', '2', '', '', '', '', 1768225660, 1768225660, 1768225712),
	(NULL, $newuserid, $newmrahid, 'live', '20', 'white', 'goat', 'male', 1, '2', '', '', '', '2', '', '', '', '', 1768225747, 1768225747, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '21', 'white', 'goat', 'female', 1, '3', '', '', '', '3', '', '', '0011-white', '', 1770044401, 1767120267, 1768225857),
	(NULL, $newuserid, $newmrahid, 'live', '22', 'white', 'goat', 'female', 1, '3', '', '', '', '3', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '23', 'white', 'goat', 'male', 1, '3', '', '', '', '3', '', '', '', '', 1770044401, 1767120267, NULL),
	(NULL, $newuserid, $newmrahid, 'sold', '500', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1050', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '501', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1050', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '502', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1050', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '583', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1100', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '584', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1150', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '585', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '586', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '587', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '588', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '389', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '800', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '590', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '591', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '592', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '593', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '950', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '594', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'sold', '595', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1770044401, 1767120267, 1769345547),
	(NULL, $newuserid, $newmrahid, 'live', '1', 'yellow', 'harri', 'female', 0, '36', '', '', '', '36', 'ولادة مفردة رخله^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '2', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'ولادة مفردة طلي^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '3', 'yellow', 'harri', 'male', 1, '1', '', '', '', '1', '', '', '0002-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '4', 'yellow', 'harri', 'female', 1, '1', '', '', '', '1', '', '', '0001-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '5', 'yellow', 'harri', 'female', 0, '12', '', '', '', '12', 'ولادة مفردة رخله^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '6', 'yellow', 'harri', 'female', 1, '1', '', '', '', '1', '', '', '0005-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '7', 'yellow', 'harri', 'female', 0, '12', '', '', '', '12', 'ولادة مفردة طلي^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '8', 'yellow', 'harri', 'male', 1, '1', '', '', '', '1', '', '', '0007-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '9', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'ولادة توأم ^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '10', 'yellow', 'harri', 'female', 1, '1', '', ' مولوده توأم', '', '1', '', '', '0009-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '11', 'yellow', 'harri', 'female', 1, '1', '', ' مولوده توأم', '', '1', '', '', '0009-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '12', 'yellow', 'harri', 'female', 0, '36', '', '', '', '36', 'ولادة مفردة طلي^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '13', 'yellow', 'harri', 'male', 1, '1', '', 'مشروع فحل', '', '1', '', '', '0012-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '14', 'yellow', 'harri', 'female', 0, '12', '', '', '', '12', 'ولادة مفردة رخله^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '15', 'yellow', 'harri', 'female', 1, '1', '', '', '', '1', '', '', '0014-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '16', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'ولادة مفردة طلي^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '17', 'yellow', 'harri', 'male', 1, '1', '', '', '', '1', '', '', '0016-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '18', 'yellow', 'harri', 'female', 0, '36', '', '', '', '36', 'ولادة توأم ^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '19', 'yellow', 'harri', 'female', 1, '1', '', ' مولوده توأم', '', '1', '', '', '0018-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '20', 'yellow', 'harri', 'male', 1, '1', '', ' مولوده توأم', '', '1', '', '', '0018-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '21', 'yellow', 'harri', 'female', 0, '12', '', '', '', '12', 'ولادة توأم ^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'dead', '22', 'yellow', 'harri', 'female', 1, '1', '', ' مولوده توأم', '', '1', '', '', '0021-yellow', '800', 1769527406, 1769527406, 1770042577),
	(NULL, $newuserid, $newmrahid, 'live', '23', 'yellow', 'harri', 'male', 1, '1', '', ' مولوده توأم', '', '1', '', '', '0021-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '24', 'yellow', 'harri', 'female', 0, '48', '', '', '', '48', 'ولادة مفردة رخله^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '25', 'yellow', 'harri', 'female', 1, '1', '', '', '', '1', '', '', '0024-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '26', 'yellow', 'harri', 'female', 0, '36', '', '', '', '36', 'ولادة توأم ^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '27', 'yellow', 'harri', 'female', 1, '1', '', ' مولوده توأم', '', '1', '', '', '0026-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '28', 'yellow', 'harri', 'male', 1, '1', '', ' مولوده توأم', '', '1', '', '', '0026-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '29', 'yellow', 'harri', 'female', 0, '10', '', '', '', '10', 'ولادة مفردة رخله^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '30', 'yellow', 'harri', 'female', 1, '1', '', '', '', '1', '', '', '0029-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '31', 'yellow', 'harri', 'female', 0, '36', '', '', '', '36', 'ولادة مفردة رخله^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '32', 'yellow', 'harri', 'female', 1, '1', '', '', '', '1', '', '', '0031-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '33', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'ولادة مفردة رخله^1766762667', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '34', 'yellow', 'harri', 'female', 1, '1', '', '', '', '1', '', '', '0033-yellow', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '35', 'yellow', 'harri', 'male', 0, '12', '', 'فحل', '', '12', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '36', 'yellow', 'harri', 'male', 1, '7', '', 'فحل مستقبلي', '', '7', '', '', '', '', 1769527406, 1769527406, 1770041585),
	(NULL, $newuserid, $newmrahid, 'live', '37', 'yellow', 'harri', 'male', 1, '2', '', 'مولود رباعي', '', '2', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '38', 'yellow', 'harri', 'male', 0, '48', '', 'فحل', '', '48', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '39', 'yellow', 'harri', 'female', 0, '48', '', '', '', '48', 'ولادة مفردة^1759843055,مضرع  ^1767991566', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '40', 'yellow', 'harri', 'female', 0, '36', '', '', '', '36', 'ولادة توأم^1762434223,مضرع  ^1767991567', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '41', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'ولادة مفردة^1757251275,مضرع  ^1767991568', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '42', 'yellow', 'harri', 'female', 0, '48', '', '', '', '48', 'ولادة مفردة^1762435179,مضرع  ^1767991569', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '43', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'ولادة مفردة^1759846671,مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '44', 'yellow', 'harri', 'female', 1, '6', '', '', '', '6', 'مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '45', 'yellow', 'harri', 'female', 1, '6', '', '', '', '6', 'مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '46', 'yellow', 'harri', 'female', 0, '36', '', '', '', '36', 'ولادة مفردة^1765026914,مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '47', 'yellow', 'harri', 'female', 0, '36', '', '', '', '36', 'ولادة مفردة^1757254695,مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '48', 'yellow', 'harri', 'female', 1, '7', '', '', '', '7', 'ولادة مفردة^1762434841', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '49', 'yellow', 'harri', 'female', 1, '3', '', '', '', '3', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '50', 'yellow', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '51', 'yellow', 'harri', 'female', 0, '48', '', '', '', '48', 'ولادة مفردة^1739106579,موت ولادة مفردة^1762434625,مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '52', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '53', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'ولادة رباعية ٣ رخال وطلي^1762265123,مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '54', 'yellow', 'harri', 'female', 1, '7', '', '', '', '7', 'مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '55', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'ولادة مفردة^1757164530,مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '56', 'yellow', 'harri', 'female', 1, '10', '', '', '', '1', '', '', '', '', 1770559994, 1769527406, 1770559994),
	(NULL, $newuserid, $newmrahid, 'live', '57', 'yellow', 'harri', 'female', 0, '9', '', '', '', '9', 'مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '58', 'yellow', 'harri', 'female', 1, '3', '', '', '', '3', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '59', 'yellow', 'harri', 'female', 0, '10', '', '', '', '10', 'مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '60', 'yellow', 'harri', 'female', 1, '7', '', '', '', '7', 'مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '61', 'yellow', 'harri', 'female', 0, '36', '', '', '', '36', 'ولادة مفردة^1751981095,مضرع  ^1767991570', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '62', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'ولادة مفردة^1762434702,مضرع  ^1767991571', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '63', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'ولادة مفردة^1762348490,مضرع  ^1767991572', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '64', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'مضرع  ^1767991573', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '65', 'yellow', 'harri', 'female', 0, '36', '', '', '', '36', 'مضرع  ^1767991574', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '66', 'yellow', 'harri', 'female', 0, '18', '', '', '', '18', 'مضرع  ^1767991575', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '67', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'مضرع  ^1767991576', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '68', 'yellow', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع  ^1767991577', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '69', 'yellow', 'harri', 'female', 1, '7', '', '', '', '7', 'مضرع  ^1767991578', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '70', 'yellow', 'harri', 'female', 1, '7', '', '', '', '7', 'مضرع  ^1767991579', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '71', 'yellow', 'harri', 'female', 1, '3', '', '', '', '3', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '72', 'yellow', 'harri', 'female', 1, '4', '', '', '', '4', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '73', 'yellow', 'harri', 'female', 0, '48', '', '', '', '48', 'ولادة مفردة رخله^1760278991,مضرع  ^1767991579', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '74', 'yellow', 'harri', 'female', 1, '7', '', '', '', '7', 'مضرع  ^1767991579', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '75', 'yellow', 'harri', 'female', 1, '7', '', '', '', '7', 'مضرع  ^1767991579', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '76', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'موت ولادة مفردة^1765027155,مضرع  ^1767991579', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '77', 'yellow', 'harri', 'female', 0, '8', '', '', '', '8', 'مضرع  ^1767991580', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '78', 'yellow', 'harri', 'female', 0, '48', '', '', '', '48', 'مضرع  ^1767991581', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '79', 'yellow', 'harri', 'female', 0, '8', '', '', '', '8', 'مضرع  ^1767991582', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '80', 'yellow', 'harri', 'female', 0, '8', '', '', '', '8', 'مضرع  ^1767991583', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '81', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'مضرع  ^1767991584', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '82', 'yellow', 'harri', 'female', 0, '8', '', '', '', '8', 'مضرع  ^1767991585', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '83', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'ولادة مفردة طلي^1760192212,مضرع  ^1767991586', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '84', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'مضرع  ^1767991587', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '85', 'yellow', 'harri', 'female', 0, '24', '', '', '', '24', 'ولادة مفردة^1765027034,مضرع  ^1767991588', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '86', 'yellow', 'harri', 'female', 0, '12', '', '', '', '12', 'مضرع  ^1767991589', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '88', 'yellow', 'harri', 'female', 1, '3', '', '', '', '3', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '89', 'yellow', 'harri', 'female', 1, '2', '', 'مولود توام', '', '2', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '90', 'yellow', 'harri', 'female', 1, '2', '', 'مولود توام', '', '2', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '91', 'yellow', 'harri', 'female', 1, '2', '', 'مولود رباعي', '', '2', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '92', 'yellow', 'harri', 'female', 1, '2', '', 'مولود رباعي', '', '2', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '93', 'yellow', 'harri', 'female', 1, '2', '', 'مولود رباعي', '', '2', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '94', 'yellow', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '95', 'yellow', 'harri', 'female', 1, '2', '', '', '', '2', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'live', '96', 'yellow', 'harri', 'male', 1, '2', '', 'فحل مستقبلي', '', '2', '', '', '', '', 1769527406, 1769527406, NULL),
	(NULL, $newuserid, $newmrahid, 'dead', '17', 'yellow', 'harri', 'female', 0, '48', '', '', '', '', 'مضرع^1767991586', '', '', '700', 1767120267, 1767120267, 1769182023),
	(NULL, $newuserid, $newmrahid, 'sold', '68', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1767120267, 1767120267, 1768694422),
	(NULL, $newuserid, $newmrahid, 'sold', '61', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1767120267, 1767120267, 1768694422),
	(NULL, $newuserid, $newmrahid, 'sold', '62', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1767120267, 1767120267, 1768694422),
	(NULL, $newuserid, $newmrahid, 'sold', '67', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1767120267, 1767120267, 1768694422),
	(NULL, $newuserid, $newmrahid, 'sold', '73', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1767120267, 1767120267, 1768694422),
	(NULL, $newuserid, $newmrahid, 'sold', '85', 'yellow', 'harri', 'male', 1, '3', '', '', '', '3', '', '', '', '1000', 1767120267, 1767120267, 1768694422)");
	
	$ins = mysqli_query($link,"INSERT INTO `suppliers` (`id`, `userid`, `mrahid`, `category`, `suppliername`, `suppliermobile`, `total`, `paid`, `time`) VALUES
	(NULL, $newuserid, $newmrahid, 'feed', 'مورد شعير', '0555555554', '44060', '44060', 1768509580),
	(NULL, $newuserid, $newmrahid, 'feed', 'مورد برسيم', '0555555553', '17000', '15000', 1768509628),
	(NULL, $newuserid, $newmrahid, 'feed', 'مورد تبن', '0555555552', '11413.5', '8916', 1768509880),
	(NULL, $newuserid, $newmrahid, 'water', 'مقاول الماء', '0555555551', '100', '100', 1769005829),
	(NULL, $newuserid, $newmrahid, 'others', 'البيطري', '0555555555', '140', '140', 1770686679),
	(NULL, $newuserid, $newmrahid, 'others', 'البيطري', '0555555555', '25', '0', 1770686741)");
	
	$ins = mysqli_query($link,"INSERT INTO `water` (`id`, `userid`, `mrahid`, `type`, `unit`, `quantity`, `unitcost`, `dailyintake`) VALUES
	(NULL, $newuserid, $newmrahid, 'water', 'liter', '5400', '0.012', '1400')");
	

	$responseArray = array('id' => 'success', 'message' => $newmrahid);
		// if ( $description == $existingdescription && $cost == $existingcost && $cycle == $existingcycle && $start == $existingstart && $end == $existingend ) {
			// $responseArray = array('id' => 'danger', 'message' => 'بيانات التكلفه المعدله مطابقه للسابق');		goto end;
		// } 
		
		// $record = mysqli_query($link,"SELECT * FROM `opex` WHERE userid = '$userid' AND mrahid = '$mrahid' AND description = '$description' AND cost = '$cost' AND cycle = '$cycle' AND start = '$start' AND end = '$end' ");
		// if(@mysqli_num_rows($record) > 0){
			// $responseArray = array('id' => 'danger', 'message' => 'التكلفه الشهريه مضافه مسبقاً');		goto end;
		// } else {
			// $log .= 'تم تعديل التكلفه التشغيليه';
			// $log .= ' للمعرف رقم '.$id;
			// if ( $description !== $existingdescription ) {	$log .= ' بنغيير الوصف من '.$existingdescription.' إلى '.$description;	}
			// if ( $cost != $existingcost ) {	$log .= ' تغيير التكلفه من '.$existingcost.' إلى '.$cost.' ريال';	}
			// if ( $cycle !== $existingcycle ) {	
				// $log .= ' تغيير دورة التكلفه من '.arabic($existingcycle).' إلى '.arabic($cycle);
				// if ( $existingcycle == 'monthly') { 
					// $log .= ' وتغيير تاريخ التكلفه من شهر '.arabic(date('m', $existingstart)).' '.date('Y', $existingstart).' إلى تكلفه سنويه تبدأ '.arabic(date('m', $start)).' '.date('Y', $existingstart);
				// }
				// if ( $existingcycle == 'yearly') { 
					// $log .= ' وتغيير تاريخ التكلفه من '.arabic(date('m', $existingstart)).' '.date('Y', $existingstart).' إلى تكلفه شهريه لشهر '.arabic(date('m', $start)).' '.date('Y', $existingstart);	
				// }
			// } else {
				// if ( $start !== $existingstart ) {
					// if ( $existingcycle == 'monthly') {
						// $log .= ' وتغيير تاريخ التكلفه من شهر '.arabic(date('m', $existingstart)).' '.date('Y', $existingstart).' إلى شهر '.arabic(date('m', $start)).' '.date('Y', $start);	
					// }
					// if ( $existingcycle == 'yearly') {
						// $log .= ' وتغيير تاريخ التكلفه من '.arabic(date('m', $existingstart)).' '.date('Y', $existingstart).' ليدأ '.arabic(date('m', $start)).' '.date('Y', $start);	
					// }
				// }
			// }
			// $log .= ' لمراح '.$mrahname;
			
			
			// $update = mysqli_query($link,"UPDATE `opex` SET `description`='$description', `cost`='$cost' , `cycle`='$cycle' , `start`='$start' , `end`='$end', `timeedited`='$time' WHERE `id`='$id'");
			
			// if ($update) {	
				// $responseArray = array('id' => 'success', 'message' => 'تم التحديث بنجاح' );
				// $logins = mysqli_query($link,"INSERT INTO `logs`( `id`,`userid`,`mrahid`,`category`,`title`,`details`,`time` )VALUES( NULL,'$userid','$mrahid','opex','تعديل تكلفه تشغيليه','$log','$time' )");
			// } else {
				// $responseArray = array('id' => 'danger', 'message' => 'خطأ في قاعدة البيانات $update faild');
			// }
		// }
		// $responseArray = array('id' => 'danger', 'message' => 'لم يتم العثور على مستخدم');		goto end;	

			
			/*
			if(isset($_POST['key']) && !empty($_POST['key']) && $_POST['key'] == 'delete' )   {
				if (!isset($_POST['id']) || empty($_POST['id']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'معرف التكلفه مطلوب');
				} elseif(!isset($_POST['category']) || empty($_POST['category']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'نوع التكلفه مطلوب');
				} else {
					$id = mysqli_real_escape_string($link, $_POST['id']);
					$category = mysqli_real_escape_string($link, $_POST['category']);
					
					$record = mysqli_query($link,"SELECT * FROM `$category` WHERE userid = '$userid' AND mrahid = '$mrahid' AND id = '$id'  ");
					if(@mysqli_num_rows($record) < 1){
						$responseArray = array('id' => 'danger', 'message' => 'لم يتم العثور على التكلفه');		goto end;	
					} else {
						if ( $category == 'opex' ) {
							while($info = mysqli_fetch_array($record, MYSQLI_ASSOC)){
								$description = $info['description'];
								$cycle = $info['cycle'];
								$cost  = $info['cost'];
								$start = $info['start'];
								$end = $info['end'];
							}
							
							$log .= 'تم حذف تكلفه تشغيليه';
							$log .= ' بمعرف رقم '.$id;
							$log .= ' بشكل '.arabic($cycle);
							$log .= ' بوصف '.$description;
							$log .= ' بمبلغ '.$cost.' ريال';

							if ($cycle == 'monthly') {	$log .= ' لشهر '.arabic(date('m', $start)).' '.date('Y', $start);	}
							if ($cycle == 'yearly') {	$log .= ' يبدأ من شهر '.arabic(date('m', $start)).' '.date('Y', $start);	}

							$log .= ' لمراح '.$mrahname;
							$title = 'حذف تكلفه تشغيليه';
						}
						
						if ( $category == 'capex' ) {
							while($info = mysqli_fetch_array($record, MYSQLI_ASSOC)){
								$description = $info['description'];
								$cost  = $info['cost'];
							}
							
							$log .= 'تم حذف تكلفه رأس ماليه';
							$log .= ' بمعرف رقم '.$id;
							$log .= ' بوصف '.$description;
							$log .= ' بمبلغ '.$cost.' ريال';
							$log .= ' لمراح '.$mrahname;
							$title = 'حذف تكلفه رأس ماليه';
						}
						
 						$delete = mysqli_query($link,"DELETE FROM `$category` WHERE id = '$id' "); 
						// $delete = true;
						if (isset($delete)) {	
							$responseArray = array('id' => 'success', 'message' => 'تم حذف التكلفه بنجاح');
							$logins = mysqli_query($link,"INSERT INTO `logs`( `id`,`userid`,`mrahid`,`category`,`title`,`details`,`time` )VALUES( NULL,'$userid','$mrahid','$category','$title','$log','$time' )");
						} else {
							$responseArray = array('id' => 'danger', 'message' => 'خطأ في قاعدة البيانات isset($delete)');
						}
					}
				}
			} elseif(isset($_POST['key']) && !empty($_POST['key']) && $_POST['key'] == 'editopex' )   {
				if (!isset($_SESSION['mrahid']) || empty($_SESSION['mrahid']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'لا يوجد معرف للمراح');
				} elseif (!isset($_POST['id']) || empty($_POST['id']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'معرف التكلفه مطلوب');
				} elseif (!isset($_POST['description']) || empty($_POST['description']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'وصف التكاليف التشغيلية مطلوب');
				} elseif (!isset($_POST['cost']) || empty($_POST['cost']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'قيمة التكاليف التشغيلية مطلوبه');
				} elseif ( !is_numeric($_POST['cost'])  )   {
					$responseArray = array('id' => 'danger', 'message' => 'قيمة التكلفه يجب أن تحتوي على أرقام فقط');
				} elseif (!isset($_POST['cycle']) || empty($_POST['cycle']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'دورة التكلفة مطلوبه');
				} elseif (!isset($_POST['month']) || empty($_POST['month']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'شهر التكلفه مطلوب');
				} elseif (!isset($_POST['year']) || empty($_POST['year']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'عام التكلفه مطلوب');
				} else {
					$mrahid = $_SESSION["mrahid"];
					$mrahname = $_SESSION["mrahname"];
					$id = mysqli_real_escape_string($link, $_POST['id']);
					$description = mysqli_real_escape_string($link, $_POST['description']);
					$cost = mysqli_real_escape_string($link, $_POST['cost']);
					$cycle = mysqli_real_escape_string($link, $_POST['cycle']);
					$month = mysqli_real_escape_string($link, $_POST['month']);
					$year = mysqli_real_escape_string($link, $_POST['year']);

					// $cycledate = strftime("%F", strtotime($year."-".$month."-01"));		// Construct Date
					// $start = strtotime($cycledate);										// Get unix
					$cycledate = date("Y-m-d", strtotime("$year-$month-01"));
					$start = strtotime($cycledate); // This is now redundant, see optimization below
					$cycledateformatted = Time_Passed(date($start),'time'); 			// For logging purposes ($logins)
					if ($cycle == 'monthly') {	$next = date('Y-m-d', strtotime('+1 month', strtotime($cycledate))); 	 }
					if ($cycle == 'yearly') {	$next = date('Y-m-d', strtotime('+1 year', strtotime($cycledate)));		 }
					$end = strtotime($next) - 1;										// Get unix of the end (-1 deduct a second)
										
					// check if opex exists
					$record = mysqli_query($link,"SELECT * FROM `opex` WHERE id = '$id' AND userid = '$userid' AND mrahid = '$mrahid'");
					if(@mysqli_num_rows($record) > 0){
						while($info = mysqli_fetch_array($record, MYSQLI_ASSOC)){ 							
							$existingdescription = $info['description'];
							$existingcost = $info['cost'];
							$existingcycle = $info['cycle'];
							$existingstart = $info['start'];		$existingstart = (int)$existingstart;
							$existingend = $info['end'];	
							$existingtimeadded = $info['timeadded'];							
							$existingtimeedited = $info['timeedited'];							
						}

						if ( $description == $existingdescription && $cost == $existingcost && $cycle == $existingcycle && $start == $existingstart && $end == $existingend ) {
							$responseArray = array('id' => 'danger', 'message' => 'بيانات التكلفه المعدله مطابقه للسابق');		goto end;
						} 
						
						$record = mysqli_query($link,"SELECT * FROM `opex` WHERE userid = '$userid' AND mrahid = '$mrahid' AND description = '$description' AND cost = '$cost' AND cycle = '$cycle' AND start = '$start' AND end = '$end' ");
						if(@mysqli_num_rows($record) > 0){
							$responseArray = array('id' => 'danger', 'message' => 'التكلفه الشهريه مضافه مسبقاً');		goto end;
						} else {
							$log .= 'تم تعديل التكلفه التشغيليه';
							$log .= ' للمعرف رقم '.$id;
							if ( $description !== $existingdescription ) {	$log .= ' بنغيير الوصف من '.$existingdescription.' إلى '.$description;	}
							if ( $cost != $existingcost ) {	$log .= ' تغيير التكلفه من '.$existingcost.' إلى '.$cost.' ريال';	}
							if ( $cycle !== $existingcycle ) {	
								$log .= ' تغيير دورة التكلفه من '.arabic($existingcycle).' إلى '.arabic($cycle);
								if ( $existingcycle == 'monthly') { 
									$log .= ' وتغيير تاريخ التكلفه من شهر '.arabic(date('m', $existingstart)).' '.date('Y', $existingstart).' إلى تكلفه سنويه تبدأ '.arabic(date('m', $start)).' '.date('Y', $existingstart);
								}
								if ( $existingcycle == 'yearly') { 
									$log .= ' وتغيير تاريخ التكلفه من '.arabic(date('m', $existingstart)).' '.date('Y', $existingstart).' إلى تكلفه شهريه لشهر '.arabic(date('m', $start)).' '.date('Y', $existingstart);	
								}
							} else {
								if ( $start !== $existingstart ) {
									if ( $existingcycle == 'monthly') {
										$log .= ' وتغيير تاريخ التكلفه من شهر '.arabic(date('m', $existingstart)).' '.date('Y', $existingstart).' إلى شهر '.arabic(date('m', $start)).' '.date('Y', $start);	
									}
									if ( $existingcycle == 'yearly') {
										$log .= ' وتغيير تاريخ التكلفه من '.arabic(date('m', $existingstart)).' '.date('Y', $existingstart).' ليدأ '.arabic(date('m', $start)).' '.date('Y', $start);	
									}
								}
							}
							$log .= ' لمراح '.$mrahname;
							
							
							$update = mysqli_query($link,"UPDATE `opex` SET `description`='$description', `cost`='$cost' , `cycle`='$cycle' , `start`='$start' , `end`='$end', `timeedited`='$time' WHERE `id`='$id'");
							
							if ($update) {	
								$responseArray = array('id' => 'success', 'message' => 'تم التحديث بنجاح' );
								$logins = mysqli_query($link,"INSERT INTO `logs`( `id`,`userid`,`mrahid`,`category`,`title`,`details`,`time` )VALUES( NULL,'$userid','$mrahid','opex','تعديل تكلفه تشغيليه','$log','$time' )");
							} else {
								$responseArray = array('id' => 'danger', 'message' => 'خطأ في قاعدة البيانات $update faild');
							}
						}
					} else {
						$responseArray = array('id' => 'danger', 'message' => 'لم يتم العثوؤ على التكلفه المطلوبه');	
					}
				}
			} elseif(isset($_POST['key']) && !empty($_POST['key']) && $_POST['key'] == 'editcapex' )   {
				if (!isset($_SESSION['mrahid']) || empty($_SESSION['mrahid']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'لا يوجد معرف للمراح');
				} elseif (!isset($_POST['id']) || empty($_POST['id']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'معرف التكلفه مطلوب');
				} elseif (!isset($_POST['description']) || empty($_POST['description']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'وصف التكاليف التشغيلية مطلوب');
				} elseif (!isset($_POST['cost']) || empty($_POST['cost']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'قيمة التكاليف التشغيلية مطلوبه');
				} elseif ( !is_numeric($_POST['cost'])  )   {
					$responseArray = array('id' => 'danger', 'message' => 'قيمة التكلفه يجب أن تحتوي على أرقام فقط');
				} else {
					$mrahid = $_SESSION["mrahid"];
					$mrahname = $_SESSION["mrahname"];
					$id = mysqli_real_escape_string($link, $_POST['id']);
					$description = mysqli_real_escape_string($link, $_POST['description']);
					$cost = mysqli_real_escape_string($link, $_POST['cost']);
										
					// check if opex exists
					$record = mysqli_query($link,"SELECT * FROM `capex` WHERE id = '$id' AND userid = '$userid' AND mrahid = '$mrahid'");
					if(@mysqli_num_rows($record) > 0){
						while($info = mysqli_fetch_array($record, MYSQLI_ASSOC)){ 							
							$existingdescription = $info['description'];
							$existingcost = $info['cost'];
							$existingtimeadded = $info['timeadded'];							
							$existingtimeedited = $info['timeedited'];							
						}

						if ( $description == $existingdescription && $cost == $existingcost ) {
							$responseArray = array('id' => 'danger', 'message' => 'بيانات التكلفه المعدله مطابقه للسابق');		goto end;
						} 
						
						$record = mysqli_query($link,"SELECT * FROM `capex` WHERE userid = '$userid' AND mrahid = '$mrahid' AND description = '$description' AND cost = '$cost' ");
						if(@mysqli_num_rows($record) > 0){
							$responseArray = array('id' => 'danger', 'message' => 'التكلفه الرأسماليه مضافه مسبقاً');		goto end;
						} else {
							$log .= 'تم تعديل التكلفه الرأسماليه';
							$log .= ' للمعرف رقم '.$id;
							if ( $description !== $existingdescription ) {	$log .= ' بنغيير الوصف من '.$existingdescription.' إلى '.$description;	}
							if ( $cost != $existingcost ) {	$log .= ' تغيير التكلفه من '.$existingcost.' إلى '.$cost.' ريال';	}
							$log .= ' لمراح '.$mrahname;
							
							$update = mysqli_query($link,"UPDATE `capex` SET `description`='$description', `cost`='$cost', `timeedited`='$time' WHERE `id`='$id'");
							
							if ($update) {	
								$responseArray = array('id' => 'success', 'message' => 'تم التحديث بنجاح' );
								$logins = mysqli_query($link,"INSERT INTO `logs`( `id`,`userid`,`mrahid`,`category`,`title`,`details`,`time` )VALUES( NULL,'$userid','$mrahid','capex','تعديل تكلفه رأسماليه','$log','$time' )");
							} else {
								$responseArray = array('id' => 'danger', 'message' => 'خطأ في قاعدة البيانات $update faild');
							}
						}
					} else {
						$responseArray = array('id' => 'danger', 'message' => 'لم يتم العثوؤ على التكلفه المطلوبه');	
					}
				}		
			} elseif(isset($_POST['key']) && !empty($_POST['key']) && $_POST['key'] == 'addopex' )   {
				if (!isset($_SESSION['mrahid']) || empty($_SESSION['mrahid']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'لا يوجد معرف للمراح');
				} elseif (!isset($_POST['description']) || empty($_POST['description']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'وصف التكاليف التشغيلية مطلوب');
				} elseif (!isset($_POST['cost']) || empty($_POST['cost']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'قيمة التكاليف التشغيلية مطلوبه');
				} elseif ( !is_numeric($_POST['cost'])  )   {
					$responseArray = array('id' => 'danger', 'message' => 'قيمة التكلفه يجب أن تحتوي على أرقام فقط');
				} elseif (!isset($_POST['cycle']) || empty($_POST['cycle']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'دورة التكلفة مطلوبه');
				} elseif (!isset($_POST['month']) || empty($_POST['month']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'شهر التكلفه مطلوب');
				} elseif (!isset($_POST['year']) || empty($_POST['year']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'عام التكلفه مطلوب');
				} else {
					$mrahid = $_SESSION["mrahid"];
					$mrahname = $_SESSION["mrahname"];
					$description = mysqli_real_escape_string($link, $_POST['description']);
					$cost = mysqli_real_escape_string($link, $_POST['cost']);
					$cycle = mysqli_real_escape_string($link, $_POST['cycle']);
					$month = mysqli_real_escape_string($link, $_POST['month']);
					$year = mysqli_real_escape_string($link, $_POST['year']);

					// $cycledate = strftime("%F", strtotime($year."-".$month."-01"));		// Construct Date
					// $start = strtotime($cycledate);										// Get unix
					$cycledate = date("Y-m-d", strtotime("$year-$month-01"));
					$start = strtotime($cycledate); // This is now redundant, see optimization below
					$cycledateformatted = Time_Passed(date($start),'time'); 			// For logging purposes ($logins)
					if ($cycle == 'monthly') {	$next = date('Y-m-d', strtotime('+1 month', strtotime($cycledate))); 	$logcycle = 'شهري'; }
					if ($cycle == 'yearly') {	$next = date('Y-m-d', strtotime('+1 year', strtotime($cycledate)));		$logcycle = 'سنوي'; }
					$end = strtotime($next) - 1;										// Get unix of the end (-1 deduct a second)

					$log .= 'تم إضافة تكلفه تشغيليه';
					$log .= ' بشكل '.arabic($cycle);
					$log .= ' بوصف '.$description;
					$log .= ' بمبلغ '.$cost.' ريال';

					if ($cycle == 'monthly') {	$log .= ' لشهر '.arabic($month);	}
					if ($cycle == 'yearly') {	$log .= ' يبدأ من شهر '.arabic($month);	}

					$log .= ' من العام '.$year;
					$log .= ' لمراح '.$mrahname;
					
					// check if opex exists
					$record = mysqli_query($link,"SELECT * FROM `opex` WHERE userid = '$userid' AND mrahid = '$mrahid' AND description = '$description' AND start = '$start' AND end = '$end' ");
					if(@mysqli_num_rows($record) > 0){
						$responseArray = array('id' => 'warning', 'message' => 'التكلفه مضافه مسبقاً');		goto end;	
					} else {
						$ins1 = mysqli_query($link,"INSERT INTO `opex`( `id`,`userid`,`mrahid`,`description`,`cycle`,`cost`,`start`,`end` ,`status` ,`timeadded` ,`timeedited` )VALUES(	NULL,'$userid','$mrahid','$description','$cycle','$cost','$start','$end','active','$time',NULL )");
					}
					
					// Entry into History
					if ( isset($ins1) ) {	
						$responseArray = array('id' => 'success', 'message' => 'تمت الإضافة بنجاح' );
						$logins = mysqli_query($link,"INSERT INTO `logs`( `id`,`userid`,`mrahid`,`category`,`title`,`details`,`time` )VALUES( NULL,'$userid','$mrahid','opex','إضافة تكلفه تشغيليه','$log','$time' )");
					} else {
						$responseArray = array('id' => 'danger', 'message' => 'خطأ في قاعدة البيانات $ins1 faild');
					}
				}
			} elseif(isset($_POST['key']) && !empty($_POST['key']) && $_POST['key'] == 'addcapex' )   {
				if (!isset($_SESSION['mrahid']) || empty($_SESSION['mrahid']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'لا يوجد معرف للمراح');
				} elseif (!isset($_POST['description']) || empty($_POST['description']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'وصف التكاليف الرأسماليه مطلوب');
				} elseif (!isset($_POST['cost']) || empty($_POST['cost']) )   {
					$responseArray = array('id' => 'danger', 'message' => 'قيمة التكاليف الرأسماليه مطلوبه');
				} elseif ( !is_numeric($_POST['cost'])  )   {
					$responseArray = array('id' => 'danger', 'message' => 'قيمة التكلفه يجب أن تحتوي على أرقام فقط');
				} else {
					$mrahid = $_SESSION["mrahid"];
					$mrahname = $_SESSION["mrahname"];
					$description = mysqli_real_escape_string($link, $_POST['description']);
					$cost = mysqli_real_escape_string($link, $_POST['cost']);

					$log .= 'تم إضافة تكلفه رأس ماليه';
					$log .= ' بوصف '.$description;
					$log .= ' ومبلغ '.$cost.' ريال';
					$log .= ' لمراح '.$mrahname;
					
					// check if opex exists
					$record = mysqli_query($link,"SELECT * FROM `capex` WHERE userid = '$userid' AND mrahid = '$mrahid' AND description = '$description' AND cost = '$cost' ");
					if(@mysqli_num_rows($record) > 0){
						$responseArray = array('id' => 'warning', 'message' => 'التكلفه مضافه مسبقاً');		goto end;	
					} else {
						$ins1 = mysqli_query($link,"INSERT INTO `capex`( `id`,`userid`,`mrahid`,`description`,`cost`,`timeadded` ,`timeedited` )VALUES(	NULL,'$userid','$mrahid','$description','$cost','$time',NULL )");
					}
					
					// Entry into History
					if ( isset($ins1) ) {	
						$responseArray = array('id' => 'success', 'message' => 'تمت الإضافة بنجاح' );
						$logins = mysqli_query($link,"INSERT INTO `logs`( `id`,`userid`,`mrahid`,`category`,`title`,`details`,`time` )VALUES( NULL,'$userid','$mrahid','capex','إضافة تكلفه رأسماليه','$log','$time' )");
					} else {
						$responseArray = array('id' => 'danger', 'message' => 'خطأ في قاعدة البيانات $ins1 faild');
					}
				}
			} else {
				if(isset($_POST['id']) && !empty($_POST['id']))	{	
					$id = mysqli_real_escape_string($link, $_POST['id']);	
					$record = mysqli_query($link,"SELECT * FROM `opex` WHERE id = '$id' AND userid = '$userid' AND mrahid = '$mrahid'    ");
				} else { 
					$record = mysqli_query($link,"SELECT * FROM `opex` WHERE userid = '$userid' AND mrahid = '$mrahid' ORDER BY start DESC    ");
				}
					$opexnum = mysqli_num_rows($record);
					if(@mysqli_num_rows($record) > 0){									
						$z = 0;				$responseArray = [];			$Totalopexinfos = [];	
						while($opexinfo = mysqli_fetch_array($record, MYSQLI_ASSOC)){
							$id = $opexinfo['id'];
							$userid = $opexinfo['userid'];
							$mrahid = $opexinfo['mrahid'];
							$description = $opexinfo['description'];
							$cycle = $opexinfo['cycle'];				$cyclear = arabic($cycle);
							$cost = $opexinfo['cost'];
							$start = $opexinfo['start'];				$start = Time_Passed(date($opexinfo['start']),'time');
							$end = $opexinfo['end'];					$end = Time_Passed(date($opexinfo['end']),'time');
							$status = $opexinfo['status'];				$status = arabic($status);
							$timeadded = $opexinfo['timeadded'];		$timeadded = Time_Passed(date($opexinfo['timeadded']),'time');
							$timeedited = $opexinfo['timeedited'];		
							if ( !empty($timeedited) ) { $timeedited = Time_Passed(date($opexinfo['timeedited']),'time'); }

							$month = $opexinfo['start'];		$monthnumeric = date('m', $month);			$month = arabic($monthnumeric);
							$endmonth = $opexinfo['end'];		$endmonthnumeric = date('m', $endmonth);	$endmonth = arabic($endmonthnumeric);
							$year = $opexinfo['start'];			$year = date('Y', $year);
							$endyear = $opexinfo['end'];		$endyear = date('Y', $endyear);
							
							
							
							${'opexinfo'.$z} = array('id' => $id,'userid' => $userid,'mrahid' => $mrahid, 'description' => $description , 'cycle' => $cycle, 'cyclear' => $cyclear ,'cost' => $cost ,'start' => $start ,'end' => $end ,'status' => $status ,'timeadded' => $timeadded ,'timeedited' => $timeedited,'month' => $month,'monthnumeric' => $monthnumeric,'year' => $year, 'endmonth' => $endmonth,'endmonthnumeric' => $endmonthnumeric,'endyear' => $endyear );	
							$z++;
						}
					}
					
					$record = mysqli_query($link,"SELECT * FROM `capex` WHERE userid = '$userid' AND mrahid = '$mrahid' ORDER BY timeadded DESC    ");
					$capexnum = mysqli_num_rows($record);
					if(@mysqli_num_rows($record) > 0){									
						$z = 0;				$responseArray = [];			$Totalcapexinfos = [];	
						while($capexinfo = mysqli_fetch_array($record, MYSQLI_ASSOC)){
							$id = $capexinfo['id'];
							$userid = $capexinfo['userid'];
							$mrahid = $capexinfo['mrahid'];
							$description = $capexinfo['description'];
							$cost = $capexinfo['cost'];
							$timeadded = $capexinfo['timeadded'];		$timeadded = Time_Passed(date($capexinfo['timeadded']),'time');
							$timeedited = $capexinfo['timeedited'];		
							if ( !empty($timeedited) ) { $timeedited = Time_Passed(date($capexinfo['timeedited']),'time'); }
							
							${'capexinfo'.$z} = array('id' => $id,'userid' => $userid,'mrahid' => $mrahid, 'description' => $description ,'cost' => $cost ,'timeadded' => $timeadded ,'timeedited' => $timeedited );	
							$z++;
						}
					}
					

					$responseArray = array('id' => 'success', 'opexnum' => $opexnum , 'capexnum' => $capexnum );
			}
			*/
		
	
} else {
	$responseArray = array('id' => 'danger', 'message' => 'خطأ في الخادم');
}
end:
if (!empty($_SERVER['HTTP_X_REQUESTED_WITH']) && strtolower($_SERVER['HTTP_X_REQUESTED_WITH']) == 'xmlhttprequest') {
	if ( isset($opexnum) && $opexnum > 0 ){	for($a=0;$a<$opexnum;$a++){ array_push($Totalopexinfos,${'opexinfo'.$a}); }	array_push($responseArray,$Totalopexinfos); }
	if ( isset($capexnum) && $capexnum > 0 ){	for($a=0;$a<$capexnum;$a++){ array_push($Totalcapexinfos,${'capexinfo'.$a}); }	array_push($responseArray,$Totalcapexinfos); }
	$encoded = json_encode($responseArray);		header('Content-Type: application/json');	echo $encoded;
} else {    echo $responseArray['message'];		}		// else just display the message

?>

